Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Once the import completes (shouldn't take more than a couple of minutes), go to the link:http://localhost:7474[Neo4j browser], and you'll be able to observe a small summary of the data in the graph:
ja_jp: インポートの完了 (ほんの数分で完了) 後に、link:http://localhost:7474[Neo4j ブラウザー] にアクセスすると、簡単なデータのサマリーをグラフで見ることができます。

source: Once the incoming request matches a valid certificate in the truststore, your application should be able to obtain the subject by just injecting a `SecurityIdentity` as follows:
ja_jp: 受信したリクエストがトラストストアの有効な証明書と一致したら、アプリケーションは以下のように `SecurityIdentity` を注入するだけでサブジェクトを取得できるようになるはずです。

source: Once the management endpoints are enabled, data can be re-indexed via `/q/hibernate-search/reindex`, where `/q` is the default management root path and `/hibernate-search` is the default Hibernate Search root management path. It (`/hibernate-search`) can be changed via configuration property as shown below.
ja_jp: 管理エンドポイントが有効になると、 `/q/hibernate-search/reindex` 経由でデータのインデックスの再作成が可能になります。ここで、 `/q` はデフォルトの管理ルートパスで、 `/hibernate-search` はデフォルトの Hibernate Search ルート管理パスになります。 以下に示すように、(`/hibernate-search`) は設定プロパティーを介して変更できます。

source: Once the management endpoints are enabled, data can be re-indexed via `/q/hibernate-search/standalone/reindex`, where `/q` is the default management root path and `/hibernate-search/standalone/` is the default Hibernate Search root management path. It (`/hibernate-search/standalone/`) can be changed via configuration property as shown below.
ja_jp: 管理エンドポイントが有効になると、 `/q/hibernate-search/standalone/reindex` 経由でデータのインデックスの再作成が可能になります。ここで、 `/q` はデフォルトの管理ルートパスで、 `/hibernate-search/standalone/` はデフォルトの Hibernate Search ルート管理パスになります。 以下に示すように、(`/hibernate-search/standalone/`) は、設定プロパティーを介して変更できます。

source: Once the persist operation completes, and there is no errors, the Kafka transaction is committed. The result is omitted and returned as the HTTP response.
ja_jp: 永続化操作が完了し、エラーが発生しない場合は、Kafka トランザクションがコミットされます。結果は省略され、HTTP 応答として返されます。

source: Once the persist operation completes, we send the entity to Kafka. The `send` method returns a `Uni<Void>`.
ja_jp: 永続化操作が完了すると、エンティティーを Kafka に送信します。 `send` メソッドは `Uni<Void>` を返します。

source: Once the project name is determined, Compose Dev Services first tries to discover existing services with that project name.
ja_jp: プロジェクト名が決定されると、Compose Dev Services はまず、そのプロジェクト名で既存のサービスを検出を試みます。

source: Once the reply is received by the sender, the content is written to the HTTP response
ja_jp: 送信者が応答を受信すると、HTTP レスポンスに内容が書き込まれます。

source: Once the response is received, extract it as a JSON Object
ja_jp: レスポンスを受信したら、JSONオブジェクトとして取り出します。

source: Once the startup completes, stop the process and generate the stacks:
ja_jp: 起動が完了したら、プロセスを停止し、スタックを生成します:

source: Once the startup has complete, press `Ctrl-C` on the `stackcount` shell.
ja_jp: 起動が完了したら、 `stackcount` シェルで `Ctrl-C` を押してください。

source: Once the virtual machine restarts, you should be good to run dev services.
ja_jp: 仮想マシンが再起動したら、Dev Services の実行が可能になるはずです。

source: Once there, on the left side under `Manage`, click on `App registrations` then click on `New registration`:
ja_jp: そこで、左側の `Manage` の下にある `App registrations` をクリックしてから、 `New registration` をクリックします。

source: Once this has been run your project should have its dependencies, source code and documentation updated to use Quarkus 3.
ja_jp: これを実行すると、プロジェクトの依存関係、ソースコード、ドキュメントがQuarkus 3を使用するように更新されます。

source: Once this is done, we are able to consume the `GitHubApiClassWithBridgeMethodsBuildItem` from any Quarkus `@BuildStep` so this list is generally available to the Quarkus build.
ja_jp: これが完了すると、どのQuarkus `@BuildStep` からでも、 `GitHubApiClassWithBridgeMethodsBuildItem` を消費できるようになるので、このリストはQuarkusビルドで一般的に利用できるようになります。

source: Once upon a time, I came across https://zestedesavoir.com/billets/4876/quarkus-spring-boot-et-les-monolithes/[an article comparing Spring Boot and Quarkus for building large monoliths] (it's in French, apologies to non-French speakers, but the results are largely self-explanatory).
ja_jp: 昔々、私は大規模なモノリスを構築するためのSpring BootとQuarkusを比較した記事 https://zestedesavoir.com/billets/4876/quarkus-spring-boot-et-les-monolithes/[（フランス語で書かれているため、フランス語を話さない方には申し訳ありませんが、結果はほぼ自明です）] に出会いました。

source: Once upon a time, Quarkus defined additional endpoints for things like health checks and metrics. They were served from the `quarkus.http.root-path` alongside any endpoints the application defined. This isn't always obvious, as `quarkus.http.root-path` is `/` by default, making it effectively invisible.
ja_jp: 昔々、Quarkusでは、ヘルスチェックやメトリクスなどのエンドポイントを追加で定義していました。これらは、アプリケーションが定義したエンドポイントと一緒に `quarkus.http.root-path` から提供されていました。デフォルトでは `quarkus.http.root-path` は `/` であり、事実上見えないようになっているため、これは必ずしも明らかではありません。

source: Once we have an `Engine` instance we could parse the template contents:
ja_jp: `Engine` のインスタンスがあれば、テンプレートの内容を解析することができます。

source: Once we have the Redis server running, we need to configure the Redis connection properties. This is done in the `application.properties` configuration file. Edit it to the following content:
ja_jp: Redis サーバーを起動したら、Redis 接続のプロパティーを設定する必要があります。これは `application.properties` の設定ファイルで行います。以下の内容に編集してください。

source: Once we have the localized bundles defined we need a way to _select_ the correct bundle for a specific template instance, i.e. to specify the locale for all message bundle expressions in the template. By default, the locale specified via the `quarkus.default-locale` configuration property is used to select the bundle. Alternatively, you can specify the `locale` attribute of a template instance.
ja_jp: ローカライズされたバンドルを定義したら、特定のテンプレートインスタンスに対して正しいバンドルを _select_ する方法、つまりテンプレート内のすべてのメッセージバンドル式に対してロケールを指定する方法が必要です。デフォルトでは、 `quarkus.default-locale` 設定プロパティーで指定したロケールが、バンドルの選択に使用されます。また、テンプレートインスタンスの `locale` 属性を指定することもできます。

source: Once we have the localized bundles defined, we need a way to _select_ the correct bundle for a specific template instance, i.e. to specify the locale for all message bundle expressions in the template. By default, the locale specified via the `quarkus.default-locale` configuration property is used to select the bundle. Alternatively, you can specify the `locale` attribute of a template instance.
ja_jp: ローカライズされたバンドルを定義した後、特定のテンプレートインスタンスに対して正しいバンドルを _選択_ する方法、つまりテンプレート内のすべてのメッセージバンドル式に対してロケールを指定する方法が必要です。 デフォルトでは、`quarkus.default-locale` 設定プロパティーで指定したロケールが、バンドルの選択に使用されます。 また、テンプレートインスタンスの `locale` 属性を指定することもできます。

source: Once you add the dependency, the extension will generate tracing data by default. To enable metrics or disable the OpenTelemetry extension globally or partially these are the properties to use (they are extracted from the config reference bellow):
ja_jp: 依存関係を追加すると、デフォルトでエクステンションはトレースデータを生成します。メトリクスを有効にする、もしくは OpenTelemetry エクステンションをグローバルまたは部分的に無効化するには、次のプロパティーを使用します (以下の設定リファレンスから展開されています)。

source: Once you add the dependency, the extension will generate tracing data by default. To enable metrics or disable the OpenTelemetry extension globally or partially these are the properties to use (they are extracted from the config reference below):
ja_jp: 依存関係を追加すると、デフォルトでエクステンションはトレースデータを生成します。メトリクスを有効にする、または OpenTelemetry エクステンションをグローバルまたは部分的に無効にするには、以下のプロパティーを使用します (これらは以下の設定リファレンスから抽出されています)。

source: Once you are done with the above, you're ready to use Hibernate Search with an outbox. Don't change any code, and just start your application: it will automatically detect when multiple applications are connected to the same database, and coordinate the index updates accordingly.
ja_jp: 上記の作業が完了したら、アウトボックスを使ったHibernate Searchを使用する準備が整いました。コードを変更せず、アプリケーションを起動するだけで大丈夫です。複数のアプリケーションが同じデータベースに接続されていることを自動的に検出し、それに応じてインデックスの更新が調整されます。

source: Once you are ready to promote your application into production, consider changing the above configuration values. While `cache.max.bytes.buffering=10240` will move your records faster through the topology, the default value of `10485760` is more throughput-friendly. Also condider increasing `metadata.max.age.ms` from `500`, which will update cluster metadata quickly, but will generate a lot of redundant requests, to a value closer to the default of `300000`. A `commit.interval.ms` of `1000` is good for exactly-once processing, but might generate excessive load for the default at-least-once processing with the default value of `30000`.
ja_jp: アプリケーションを本番環境に移行する準備ができたら、上記の設定値を変更することを検討してください。 `cache.max.bytes.buffering=10240` はトポロジーの中でレコードをより速く移動させますが、デフォルト値の `10485760` はよりスループットに優れています。また、 `metadata.max.age.ms` を `500` のように増やすと、クラスタのメタデータをすばやく更新できますが、冗長なリクエストが大量に発生するため、デフォルトの `300000` に近い値にすることを検討してください。 `commit.interval.ms` を `1000` にすると、完全一致の処理には適していますが、デフォルト値の `30000` では、最低一回の処理で過剰な負荷となる可能性があります。

source: Once you create the project and have your project's `client_id` and `client_secret`, you can try to configure a tenant as follows:
ja_jp: プロジェクトを作成し、プロジェクトの `client_id` と `client_secret` を取得したら、次のようにテナントの設定を試みることができます。

source: Once you have a <<project-creation, project generated>>, you can import it in your favorite IDE. The only requirement is the ability to import a Gradle project.
ja_jp: link:#project-creation[プロジェクトを生成] したら、お気に入りのIDEでインポートすることができます。唯一の条件は、Gradleプロジェクトをインポートできることです。

source: Once you have a <<project-creation, project generated>>, you can import it in your favorite IDE. The only requirement is the ability to import a Maven project.
ja_jp: <<project-creation, プロジェクトを生成したら>>、お気に入りのIDEでインポートすることができます。唯一の要件は、Mavenプロジェクトをインポートできることです。

source: Once you have a <<project-creation,project generated>>, you can import it in your favorite IDE. The only requirement is the ability to import a Gradle project.
ja_jp: <<project-creation,project generated>> の完了後、それを任意の IDE にインポートできます。唯一の要件は、Maven プロジェクトをインポートできることです。

source: Once you have a <<project-creation,project generated>>, you can import it in your favorite IDE. The only requirement is the ability to import a Maven project.
ja_jp: xref:project-creation[プロジェクトが生成されたら] 、お気に入りのIDEでインポートできます。 唯一の要件は、Mavenプロジェクトをインポートできることです。

source: Once you have a xref:project-creation[project generated], you can import it in your favorite IDE. The only requirement is the ability to import a Gradle project.
ja_jp: xref:project-creation[プロジェクトが生成されたら] 、お気に入りのIDEでインポートすることができます。唯一の条件は、Gradleプロジェクトをインポートできることです。

source: Once you have a xref:project-creation[project generated], you can import it in your favorite IDE. The only requirement is the ability to import a Maven project.
ja_jp: xref:project-creation[プロジェクトを生成] したら、お気に入りのIDEでそれをインポートすることができます。唯一の要件は、Mavenプロジェクトをインポートできることです。

source: Once you have configured the mailer, if you call the HTTP endpoint as shown above, you will send emails.
ja_jp: mailerの設定が完了したら、上記のようにHTTPエンドポイントを呼び出すと、メールが送信されます。

source: Once you have declared a `@CheckedTemplate` class, we will check that all its methods point to existing templates, so if you try to use a template from your Java code and you forgot to add it, we will let you know at build time :)
ja_jp: `@CheckedTemplate` クラスを宣言したら、すべてのメソッドが既存のテンプレートを指しているかどうかをチェックしますので、もし Java コードからテンプレートを使おうとして追加するのを忘れてしまった場合は、ビルド時にお知らせします :)

source: Once you have defined the database kind and the credentials, you are ready to configure either a JDBC datasource, a reactive one, or both.
ja_jp: データベースの種類と認証情報を定義したら、JDBC データソースまたはリアクティブデータソースのいずれか 1 つ、あるいはその両方を設定することができます。

source: Once you have finished building the native executable, you can run the native application with JFR as follows:
ja_jp: ネイティブ実行可能ファイルのビルドが完了したら、以下のように JFR を使用してネイティブアプリケーションを実行できます。

source: Once you have the dependency, just create the web client instance:
ja_jp: 依存関係ができたら、あとはWebクライアントのインスタンスを作成するだけです:

source: Once you have written your entity, here are the most common operations you will be able to perform:
ja_jp: エンティティを記述したら、ここでは実行できる最も一般的な操作を紹介します:

source: Once you have written your repository, here are the most common operations you will be able to perform:
ja_jp: リポジトリを書くことで実行可能な最も一般的な操作は以下の通りです。

source: Once you have your Quarkus Maven project configured you can add the `narayana-lra` extension by running the following command in your project base directory:
ja_jp: Quarkus Mavenプロジェクトの設定が完了したら、プロジェクトのベースディレクトリで以下のコマンドを実行して、 `narayana-lra` エクステンションを追加できます。

source: Once you have your Quarkus project configured you can add the `kubernetes-client` extension to your project by running the following command in your project base directory.
ja_jp: Quarkusプロジェクトを設定したら、プロジェクトのベースディレクトリーで次のコマンドを実行して、 `kubernetes-client` エクステンションをプロジェクトに追加できます。

source: Once you have your Quarkus project configured you can add the `kubernetes-config` extension by running the following command in your project base directory.
ja_jp: Quarkusプロジェクトを設定したら、プロジェクトのベースディレクトリーで以下のコマンドを実行して、 `kubernetes-config` エクステンションを追加できます。

source: Once you have your Quarkus project configured you can add the `picocli` extension to your project by running the following command in your project base directory.
ja_jp: Quarkus プロジェクトを設定すると、プロジェクトのベースディレクトリーで次のコマンドを実行することで、 `picocli` エクステンションをプロジェクトに追加できます。

source: Once you have your command line application, you can also generate the resources necessary to install and use this application in Kubernetes by adding the `kubernetes` extension. To install the `kubernetes` extension, run the following command in your project base directory.
ja_jp: コマンドラインアプリケーションを作成したら、 `kubernetes` エクステンションを追加することで、このアプリケーションを Kubernetes にインストールして使用するために必要なリソースを生成することもできます。 `kubernetes` エクステンションをインストールするには、プロジェクトのベースディレクトリで以下のコマンドを実行します。

source: Once you remove all the OpenTracing dependencies the code will build. Don't forget to double check if the traces contain the right spans. You can see them in the Jaeger UI: http://localhost:16686/.
ja_jp: OpenTracing の依存関係をすべて削除すると、コードがビルドされます。トレースに適切なスパンが含まれているか忘れずに再確認してください。これらは Jaeger UI で確認できます: http://localhost:16686/。

source: Once you start your app in dev mode:
ja_jp: アプリケーションを開発モードで起動します。

source: Once you've completed your application implementation, if you want to distribute and deploy your application as a *native image*, you should consider reducing its size by following these guidelines.
ja_jp: アプリケーションの実装が完了したら、そのアプリケーションを *ネイティブイメージ* として配布およびデプロイしたい場合、以下のガイドラインに従ってサイズを削減することを検討すべきです。

source: Once you've connected your cluster with the RHOAS Kafka and Service Registry instances, make sure you've granted necessary permissions to the newly created service account.
ja_jp: クラスタとRHOAS KafkaおよびService Registryインスタンスを接続したら、新しく作成したサービスアカウントに必要なパーミッションが付与されていることを確認してください。

source: Once your application is accepting secure connections, the next step is to configure a `quarkus.http.ssl.certificate.trust-store-file` holding all the certificates that your application should trust as well as how your application should ask for certificates when a client (e.g.: browser or another service) tries to access one of its protected resources.
ja_jp: アプリケーションが安全な接続を受け入れたら、次のステップは、アプリケーションが信頼すべきすべての証明書を保持する `quarkus.http.ssl.certificate.trust-store-file` を設定し、クライアント(例: ブラウザや他のサービス)が保護されたリソースにアクセスしようとしたときに、アプリケーションがどのように証明書を要求するかを設定します。

source: Once your application is running, you can open your browser and navigate to: http://localhost:8080/hello?name=Martin
ja_jp: アプリケーションが実行されたら、ブラウザーを開いてアドレス http://localhost:8080/hello?name=Martin に移動します。

source: Once your application is started, you can go to http://localhost:8080/q/swagger-ui and play with your API.
ja_jp: アプリケーションが起動したら、 http://localhost:8080/q/swagger-ui にアクセスしてAPIで遊ぶことができます。

source: Once your application is started, you can make a request to the default `/q/openapi` endpoint:
ja_jp: アプリケーションを起動すると、デフォルトの `/q/openapi` エンドポイントにリクエストを行うことができます。

source: Once you’ve located the node for the specific method you’re after, a typical question you’d want to get an answer for is: why does this method get included in the call tree? To do that, start from the method and look for incoming connections at a given depth, starting from the end method. For example, methods that directly call a method can be located via:
ja_jp: 探している特定のメソッドのノードを見つけたら、答えを得たい典型的な質問は、「なぜこのメソッドはコールツリーに含まれるのか」です。そのためには、終点のメソッドから始まる所定の深さの到着接続を探します。たとえば、あるメソッドを直接呼び出すメソッドは、以下のようにして見つけることができます。

source: One Google Cloud Functions deployment can represent any number of JAX-RS, Servlet, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] endpoints.
ja_jp: 1つのGoogle Cloud Functionsのデプロイメントは、JAX-RS、Servlet、Reactive Routes、 link:funqy-http.html[FunqyのHTTP] エンドポイントをいくつでも表すことができます。

source: One Google Cloud Functions deployment can represent any number of Jakarta REST, Servlet, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] endpoints.
ja_jp: Google Cloud Functionsのデプロイメント1つで、Jakarta REST、Servlet、Reactive Routes、xref:funqy-http.adoc[Funqy HTTP] エンドポイントをいくつでも表すことができます。

source: One azure function deployment can represent any number of JAX-RS, servlet, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] endpoints.
ja_jp: 1つのazure function deploymentは、JAX-RS、サーブレット、Reactive Routes、 link:funqy-http.html[FunqyのHTTP] エンドポイントをいくつでも表現できます。

source: One can also configure `smallrye.jwt.new-token.issuer` and `smallrye.jwt.new-token.audience` properties and skip setting the issuer and audience directly with the builder API.
ja_jp: `smallrye.jwt.new-token.issuer` プロパティーと `smallrye.jwt.new-token.audience` プロパティーを設定し、ビルダー API を使用した発行者とオーディエンスの直接設定を省略することもできます。

source: One can check the available entropy on a Linux system with:
ja_jp: Linuxシステムでは、利用可能なエントロピーは次のようにして確認することができます:

source: One can combine multiple authentication mechanisms if they get the authentication credentials from the different sources. For example, combining built-in `Basic` and `quarkus-oidc` `Bearer` authentication mechanisms is allowed, but combining `quarkus-oidc` `Bearer` and `smallrye-jwt` authentication mechanisms is not allowed because both will attempt to verify the token extracted from the HTTP `Authorization Bearer` scheme.
ja_jp: 異なるソースから認証証明書を取得する場合、複数の認証メカニズムを組み合わせることができます。例えば、組み込みの `Basic` と `Bearer` `quarkus-oidc` 認証メカニズムを組み合わせることはできますが、 `quarkus-oidc` `Bearer` と `smallrye-jwt` 認証メカニズムを組み合わせることはできません。なぜなら、両方とも HTTP `Authorization Bearer` スキームから抽出されたトークンを検証しようとするからです。

source: One can customize `HttpAuthenticationMechanism` by registering a CDI implementation bean. In the example below the custom authenticator delegates to `JWTAuthMechanism` provided by `quarkus-smallrye-jwt`:
ja_jp: CDI実装Beanを登録することで、 `HttpAuthenticationMechanism` をカスタマイズすることができます。以下の例では、カスタム認証機能は `quarkus-smallrye-jwt` によって提供される `JWTAuthMechanism` にデリゲートします。

source: One can easily add a https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] cookie property to any of the cookies set by a Quarkus endpoint by listing a cookie name and a `SameSite` attribute, for example:
ja_jp: 例えば、クッキー名と `SameSite` 属性を記載することで、 Quarkus のエンドポイントによって設定された任意のクッキーに https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] クッキープロパティを簡単に追加することができます。

source: One can register `@ApplicationScoped` bean which will observe important OIDC authentication events. The listener will be updated when a user has logged in for the first time or re-authenticated, as well as when the session has been refreshed. More events may be reported in the future. For example:
ja_jp: 重要な OIDC 認証イベントを監視する `@ApplicationScoped` Bean を登録できます。リスナーは、ユーザーが初めてログインしたとき、または再認証されたとき、およびセッションが更新されたときに更新されます。今後、さらに多くのイベントが報告される可能性があります。例えば:

source: One can see which Mandrel version was used to generate a binary by inspecting the binary as follows:
ja_jp: どのバージョンのMandrelを使ってバイナリを生成したかは、バイナリを以下のように検査すればわかります。

source: One can use `OidcClient` directly as follows:
ja_jp: 以下のように `OidcClient` を直接使用することができます。

source: One common alternative is to map each entry of the ConfigMap and / Secret to an environment variable on the Kubernetes `Deployment` - see link:https://kubernetes.io/docs/concepts/configuration/secret/#use-case-as-container-environment-variables[this] for more details. To achieve that in Quarkus, we could use the `quarkus-kubernetes` extension (which is responsible for creating Kubernetes manifests and include the following configuration) and configure it as so:
ja_jp: 一般的な代替案としては、ConfigMapと/ Secretの各エントリをKubernetes `Deployment` の環境変数にマッピングする方法があります - 詳細は link:https://kubernetes.io/docs/concepts/configuration/secret/#use-case-as-container-environment-variables[こちら]を参照してください。Quarkusでこれを実現するには、 `quarkus-kubernetes` エクステンション（Kubernetesマニフェストの作成を担当し、以下の設定を含む）を使用し、以下のように設定します。

source: One difference between the two APIs is related to laziness. The Vert.x "bare" API triggers the operation as soon as the method is called. The Mutiny variant expects a subscription to trigger the operation.
ja_jp: 2つのAPIの違いの1つは、怠惰性に関連しています。Vert.x の "素の" API は、メソッドが呼び出されるとすぐに操作をトリガーします。Mutiny 版では、操作をトリガーするためにサブスクリプションを期待しています。

source: One exception to this solution is a situation when application endpoints are secured with the xref:security-authorize-web-endpoints-reference.adoc#authorization-using-configuration[Authorization using configuration]. For more information, see the xref:security-authorize-web-endpoints-reference.adoc#policy-active-cdi-request-context[Inject RequestScoped beans into HttpSecurityPolicy] section of the "Authorization of Web endpoints" guide for more information.
ja_jp: このソリューションの例外は、アプリケーションエンドポイントが xref:security-authorize-web-endpoints-reference.adoc#authorization-using-configuration[設定を使用した承認] で保護されている場合です。 詳細は、「Web エンドポイントの認可」ガイドの xref:security-authorize-web-endpoints-reference.adoc#policy-active-cdi-request-context[RequestScoped Bean を HttpSecurityPolicy に挿入する] セクションを参照してください。

source: One extension, multiple APIs
ja_jp: 1 つのエクステンション、複数の API

source: One extremely important note before we begin: **we're not trying to criticize any library or framework here**. We also found some low-hanging fruits in Quarkus itself, **we're all in the same boat here**.
ja_jp: 始める前に、非常に重要な注意点があります。 **ここで特定のライブラリーやフレームワークを批判するつもりはありません**。Quarkus 自体にも簡単に改善できる点が見つかりました。 **私たちは皆、同じ船に乗っているのです**。

source: One fundamental API difference is that Micrometer uses a https://docs.micrometer.io/micrometer/reference/concepts/timers.html[Timer] and OpenTelemetry uses a https://opentelemetry.io/docs/specs/otel/metrics/data-model/#histogram[Histogram] to record latency (execution time) metrics and the frequency of the events.
ja_jp: 基本的な API の違いの 1 つは、Micrometer は https://docs.micrometer.io/micrometer/reference/concepts/timers.html[タイマー] を使用し、OpenTelemetry は https://opentelemetry.io/docs/specs/otel/メトリクス/data-model/#histogram[ヒストグラム] を使用して、レイテンシー (実行時間) メトリクスとイベントの頻度を記録する点です。

source: One important note is that according to the https://www.rfc-editor.org/rfc/rfc2616#section-10.3.8[RFC2616] specs, by default the redirection will only happen for GET or HEAD methods.
ja_jp: link:https://www.rfc-editor.org/rfc/rfc2616#section-10.3.8[RFC2616] 仕様によると、デフォルトではGETまたはHEADメソッドに対してのみリダイレクトが行われるという重要な注意点があります。

source: One important note is that according to the https://www.rfc-editor.org/rfc/rfc2616#section-10.3.8[RFC2616] specs, by default the redirection will only happen for GET or HEAD methods. However, in REST Client, you can provide your custom redirect handler to enable redirection on POST or PUT methods, or to follow a more complex logic, via either using the `@ClientRedirectHandler` annotation, CDI or programmatically when creating your client.
ja_jp: 重要な注意点として、 https://www.rfc-editor.org/rfc/rfc2616#section-10.3.8[RFC2616] 仕様によると、デフォルトではリダイレクトは GET または HEAD メソッドに対してのみ実行されます。しかし、REST Client では、 `@ClientRedirectHandler` アノテーションを使用するか、CDI を利用するか、またはクライアント作成時にプログラム的に設定することで、POST や PUT メソッドのリダイレクトを有効にしたり、より複雑なロジックに従ってリダイレクトを行うカスタムリダイレクトハンドラーを指定できます。
